mirmik/genos/arch/arm/stm32/src/periph/regs/timer.h
#ifndef STM32_PERIPH_TIMER_H
#define STM32_PERIPH_TIMER_H

#include <stdint.h>

struct timer_regs
{
	volatile uint16_t CR1;         /*!< TIM control register 1,              Address offset: 0x00 */
	uint16_t      RESERVED0;   /*!< Reserved, 0x02                                            */
	volatile uint16_t CR2;         /*!< TIM control register 2,              Address offset: 0x04 */
	uint16_t      RESERVED1;   /*!< Reserved, 0x06                                            */
	volatile uint16_t SMCR;        /*!< TIM slave mode control register,     Address offset: 0x08 */
	uint16_t      RESERVED2;   /*!< Reserved, 0x0A                                            */
	volatile uint16_t DIER;        /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
	uint16_t      RESERVED3;   /*!< Reserved, 0x0E                                            */
	volatile uint16_t SR;          /*!< TIM status register,                 Address offset: 0x10 */
	uint16_t      RESERVED4;   /*!< Reserved, 0x12                                            */
	volatile uint16_t EGR;         /*!< TIM event generation register,       Address offset: 0x14 */
	uint16_t      RESERVED5;   /*!< Reserved, 0x16                                            */
	volatile uint16_t CCMR1;       /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
	uint16_t      RESERVED6;   /*!< Reserved, 0x1A                                            */
	volatile uint16_t CCMR2;       /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
	uint16_t      RESERVED7;   /*!< Reserved, 0x1E                                            */
	volatile uint16_t CCER;        /*!< TIM capture/compare enable register, Address offset: 0x20 */
	uint16_t      RESERVED8;   /*!< Reserved, 0x22                                            */
	volatile uint32_t CNT;         /*!< TIM counter register,                Address offset: 0x24 */
	volatile uint16_t PSC;         /*!< TIM prescaler,                       Address offset: 0x28 */
	uint16_t      RESERVED9;   /*!< Reserved, 0x2A                                            */
	volatile uint32_t ARR;         /*!< TIM auto-reload register,            Address offset: 0x2C */
	volatile uint16_t RCR;         /*!< TIM repetition counter register,     Address offset: 0x30 */
	uint16_t      RESERVED10;  /*!< Reserved, 0x32                                            */
	union
	{
		volatile uint32_t CCR[4];
		struct
		{
			volatile uint32_t CCR1;        /*!< TIM capture/compare register 1,      Address offset: 0x34 */
			volatile uint32_t CCR2;        /*!< TIM capture/compare register 2,      Address offset: 0x38 */
			volatile uint32_t CCR3;        /*!< TIM capture/compare register 3,      Address offset: 0x3C */
			volatile uint32_t CCR4;        /*!< TIM capture/compare register 4,      Address offset: 0x40 */
		};
	};
	volatile uint16_t BDTR;        /*!< TIM break and dead-time register,    Address offset: 0x44 */
	uint16_t      RESERVED11;  /*!< Reserved, 0x46                                            */
	volatile uint16_t DCR;         /*!< TIM DMA control register,            Address offset: 0x48 */
	uint16_t      RESERVED12;  /*!< Reserved, 0x4A                                            */
	volatile uint16_t DMAR;        /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
	uint16_t      RESERVED13;  /*!< Reserved, 0x4E                                            */
	volatile uint16_t OR;          /*!< TIM option register,                 Address offset: 0x50 */
	uint16_t      RESERVED14;  /*!< Reserved, 0x52                                            */
};

/******************************************************************************/
/*                                                                            */
/*                                    TIM                                     */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for TIM_CR1 register  ********************/
#define  TIM_CR1_CEN                         ((uint16_t)0x0001)            /*!<Counter enable        */
#define  TIM_CR1_UDIS                        ((uint16_t)0x0002)            /*!<Update disable        */
#define  TIM_CR1_URS                         ((uint16_t)0x0004)            /*!<Update request source */
#define  TIM_CR1_OPM                         ((uint16_t)0x0008)            /*!<One pulse mode        */
#define  TIM_CR1_DIR                         ((uint16_t)0x0010)            /*!<Direction             */

#define  TIM_CR1_CMS                         ((uint16_t)0x0060)            /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define  TIM_CR1_CMS_0                       ((uint16_t)0x0020)            /*!<Bit 0 */
#define  TIM_CR1_CMS_1                       ((uint16_t)0x0040)            /*!<Bit 1 */

#define  TIM_CR1_ARPE                        ((uint16_t)0x0080)            /*!<Auto-reload preload enable     */

#define  TIM_CR1_CKD                         ((uint16_t)0x0300)            /*!<CKD[1:0] bits (clock division) */
#define  TIM_CR1_CKD_0                       ((uint16_t)0x0100)            /*!<Bit 0 */
#define  TIM_CR1_CKD_1                       ((uint16_t)0x0200)            /*!<Bit 1 */

/*******************  Bit definition for TIM_CR2 register  ********************/
#define  TIM_CR2_CCPC                        ((uint16_t)0x0001)            /*!<Capture/Compare Preloaded Control        */
#define  TIM_CR2_CCUS                        ((uint16_t)0x0004)            /*!<Capture/Compare Control Update Selection */
#define  TIM_CR2_CCDS                        ((uint16_t)0x0008)            /*!<Capture/Compare DMA Selection            */

#define  TIM_CR2_MMS                         ((uint16_t)0x0070)            /*!<MMS[2:0] bits (Master Mode Selection) */
#define  TIM_CR2_MMS_0                       ((uint16_t)0x0010)            /*!<Bit 0 */
#define  TIM_CR2_MMS_1                       ((uint16_t)0x0020)            /*!<Bit 1 */
#define  TIM_CR2_MMS_2                       ((uint16_t)0x0040)            /*!<Bit 2 */

#define  TIM_CR2_TI1S                        ((uint16_t)0x0080)            /*!<TI1 Selection */
#define  TIM_CR2_OIS1                        ((uint16_t)0x0100)            /*!<Output Idle state 1 (OC1 output)  */
#define  TIM_CR2_OIS1N                       ((uint16_t)0x0200)            /*!<Output Idle state 1 (OC1N output) */
#define  TIM_CR2_OIS2                        ((uint16_t)0x0400)            /*!<Output Idle state 2 (OC2 output)  */
#define  TIM_CR2_OIS2N                       ((uint16_t)0x0800)            /*!<Output Idle state 2 (OC2N output) */
#define  TIM_CR2_OIS3                        ((uint16_t)0x1000)            /*!<Output Idle state 3 (OC3 output)  */
#define  TIM_CR2_OIS3N                       ((uint16_t)0x2000)            /*!<Output Idle state 3 (OC3N output) */
#define  TIM_CR2_OIS4                        ((uint16_t)0x4000)            /*!<Output Idle state 4 (OC4 output)  */

